
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/naokichin/aws-ecs-terraform/actions/runs/5163008152)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f9c07a8c815600ad]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0394d7d021b9cee67]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0484c65d56c312aef]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-05f6d219b74a73e42]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f93c273ac6260b2f]
aws_security_group.alb: Refreshing state... [id=sg-039646b7f9fcf52ca]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0dbcdd1e5e2be2539]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07b9b3e7c1bec06dd]
aws_security_group.ecs: Refreshing state... [id=sg-01cd8352bdecb0981]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:targetgroup/go-simple-server-target-group/a4850853c188d1e0]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0edb7c4647f2a2bc7]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01b1e81a483b996ae]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09af8f91776c38a83]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06964098bf82f17d8]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00c2c9d62fba11d31]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-057dfecc352214f4e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0907aad5a5e87d8ca]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3270240793]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0cc115bd28689188f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d646a0f32af9545a]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:loadbalancer/app/go-simple-server-alb/a9c96b90952049ce]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e21b23fd2ec88248]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0afaade15c0cd691f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00c2c9d62fba11d311080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b8c300fdada68bb3]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c3f25bb5ebb606c3]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0dbcdd1e5e2be25391080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-05f6d219b74a73e421080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:listener/app/go-simple-server-alb/a9c96b90952049ce/9d32082826c82131]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:276039551011:listener-rule/app/go-simple-server-alb/a9c96b90952049ce/9d32082826c82131/f43eb3311e393bfd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"8c165e4c5a101a3407038b495d90b199943c2016","Vars":{},"WorkflowName":"Terraform"} -->